---
kind: property
id: P:Autodesk.Revit.DB.Visual.Gradient.GradientPosition
source: html/1cfa3b53-bad9-c329-4d16-9f93b4536710.htm
---
# Autodesk.Revit.DB.Visual.Gradient.GradientPosition Property

The property labeled "Position" from the "Gradient" schema.

## Syntax (C#)
```csharp
public static string GradientPosition { get; }
```

## Remarks
This property is a "AssetPropertyList" of type "AssetPropertyDouble".